### Lesson 3

--> Accessing files  
--> loc  
--> iloc

In [7]:
import pandas as pd

### Accessing files

In [16]:
coffee = pd.read_csv('coffee_data.csv')  # read_csv('[you give the file path]') is used to access the csv file 
                                         # read_excel('[you give the file path]') is used to access the excel file

In [17]:
coffee.head()   # gives the first 5 values present in the data

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [19]:
coffee.head(10) # gives the first 10 values present in the data

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35
5  Wednesday       Latte          25
6   Thursday    Espresso          40
7   Thursday       Latte          30
8     Friday    Espresso          45
9     Friday       Latte          35

In [20]:
coffee.tail() # gives the last 5 values present in the data

         Day Coffee Type  Units Sold
9     Friday       Latte          35
10  Saturday    Espresso          45
11  Saturday       Latte          35
12    Sunday    Espresso          45
13    Sunday       Latte          35

In [21]:
coffee.tail(10)  # gives the last 10 values present in the data

          Day Coffee Type  Units Sold
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [22]:
coffee.info()  # gives information about the values present in the data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Day          14 non-null     object
 1   Coffee Type  14 non-null     object
 2   Units Sold   14 non-null     int64
dtypes: int64(1), object(2)
memory usage: 468.0+ bytes

In [27]:
coffee.min()  # gives the minimum value in the data

Day              Friday
Coffee Type    Espresso
Units Sold           15
dtype: object

In [28]:
coffee.max() # gives the maximum value in the data

Day            Wednesday
Coffee Type        Latte
Units Sold            45
dtype: object

In [29]:
coffee.describe()  # gives values such as count, mean, std, min,max etc present in the data

       Units Sold
count   14.000000
mean    32.857143
std      9.346798
min     15.000000
25%     26.250000
50%     35.000000
75%     38.750000
max     45.000000

### loc

In [31]:
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [32]:
coffee.loc[0]   # Here we are trying to get the value present at location 0

Day              Monday
Coffee Type    Espresso
Units Sold           25
Name: 0, dtype: object

In [33]:
coffee.loc[10]  # Here we are trying to get the value present at location 10

Day            Saturday
Coffee Type    Espresso
Units Sold           45
Name: 10, dtype: object

In [35]:
coffee.loc[[0,1,2]] # Here we are trying to get multiple values present at location 0, location 1, location 2

       Day Coffee Type  Units Sold
0   Monday    Espresso          25
1   Monday       Latte          15
2  Tuesday    Espresso          30

In [36]:
coffee.loc[[0,7,9,1]]  # Here we are trying to get multiple values present at location 0, location 7, location 9, location 1

        Day Coffee Type  Units Sold
0    Monday    Espresso          25
7  Thursday       Latte          30
9    Friday       Latte          35
1    Monday       Latte          15

In [37]:
coffee.loc[0:]  # gives all the values from location 0 to the end

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [38]:
coffee.loc[2:] # gives the values from location 2 to the last location

          Day Coffee Type  Units Sold
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [39]:
coffee.loc[5:8] # gives the values present between location 5 and location 8

         Day Coffee Type  Units Sold
5  Wednesday       Latte          25
6   Thursday    Espresso          40
7   Thursday       Latte          30
8     Friday    Espresso          45

In [41]:
 coffee.loc[5:8,'Day']   # This provides the values of rows between location 5 and 8. It also provides the values from column 'Day' between location 5 and 8

5    Wednesday
6     Thursday
7     Thursday
8       Friday
Name: Day, dtype: object

In [42]:
coffee.loc[6:10,['Day','Units Sold']] 
# This provides the values of rows between the location 6 and 10
# It also provides the values from columns ['Day','Units Sold'] between the location 6 and 10

         Day  Units Sold
6   Thursday          40
7   Thursday          30
8     Friday          45
9     Friday          35
10  Saturday          45

### iloc

In [43]:
coffee.iloc[0]  # gives the value present at index location 0

Day              Monday
Coffee Type    Espresso
Units Sold           25
Name: 0, dtype: object

In [44]:
coffee.iloc[5] # gives the value present at index location 5

Day            Wednesday
Coffee Type        Latte
Units Sold            25
Name: 5, dtype: object

In [45]:
coffee.iloc[0:4]  # gives the values between the index location 0 and index location 4 [exclusive]

       Day Coffee Type  Units Sold
0   Monday    Espresso          25
1   Monday       Latte          15
2  Tuesday    Espresso          30
3  Tuesday       Latte          20

In [46]:
coffee.iloc[[0,2,4]]   # gives the values present at index location 0, location 2 and location 4

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
2    Tuesday    Espresso          30
4  Wednesday    Espresso          35

In [47]:
coffee.iloc[3:7,[0,2]] 
# rows --> 3:7
# columns --> 0 and 2
# gives the values present between index location 3 and index location 7 [exclusive]   --- rows 
# gives the values present between index location 0 and index location 2   --- columns

         Day  Units Sold
3    Tuesday          20
4  Wednesday          35
5  Wednesday          25
6   Thursday          40